packages/default/test/load-tests/testArt.yml
config:
  # target: http://localhost:5051
  target: "http://ec2-52-68-162-65.ap-northeast-1.compute.amazonaws.com"
  phases:
  - duration: 60
    arrivalRate: 5
    name: Warm up
  - duration: 600
    arrivalRate: 15
    name: Sustained load
  processor: "./myFunctions.js"
scenarios:
- name: get metadata
  flow:
  - get:
      beforeRequest: setJSONBody
      afterRequest: logHeaders
      url: "/"